export const generateMaterials = (count, attrs) => {
  const result = []

  for (let i = 0; i < count; i++) {

    result.push({
      key: i,
      name: name[Math.floor(Math.random() * name.length)],
      price: Math.floor(Math.random() * (100 - 10) + 10)
    })

  }

  return result
}

const name = [
  'свинец',
  'медь',
  'олово',
  'цинк',
  'никель',
  'алюминий',
  'титан',
  'магний',
  'бериллий',
  'стронций',
  'кальций',
  'литий',
  'барий',
  'калий',
  'натрий',
  'цезий',
  'рубидий',
  'Тис',
  'Сосна',
  'Пихта',
  'Лиственница',
  'Ель',
  'Берёза',
  'Бук',
  'Вяз',
  'Дуб',
  'полиэтилентерефталат',
  'полиэтилен',
  'Поливинилхлорид',
  'Полипропилен',
  'Полистирол',
  'Поликапролактон',
  'Бутадиеновый каучук',
  'Ацетат целлюлозы',
  'Целлофан',
  'Эпоксидная смола',
  'Этиленвинилацетат',
  'Природный каучук',
  'Бутадиен-нитрильный каучук',
  'Полиакрилонитрил',
  'Полиамид',
  'Полибутилентерефталат',
  'Полиэфиримид'
]